In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1={'Names':['Arvind','Samar',np.nan, 'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}

dict1

{'Names': ['Arvind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [5]:
d1=pd.DataFrame(dict1)
d1

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [6]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [7]:
dict2={'Names':['Arvind','Samar',None, 'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',None]}

dict2

{'Names': ['Arvind', 'Samar', None, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', None]}

In [8]:
d2=pd.DataFrame(dict2)
d2

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2    None  32.0  Chennai
3    Siri  43.0     None

In [9]:
d2.dtypes

Names     object
Age      float64
City      object
dtype: object

In [10]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [12]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

**Use 'None' for Object columns and np.nan(not a number) for numerical columns**.

- Generally data has some empty rows
- It is a data problem
- If you read that kind of data you will see null
- You need to understand if the data is corrupted or really null values are there

**Method-1**
- Fill with some random value
- Method name: fillna

In [14]:
d1.fillna(40)

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2      40  32.0  Chennai
3    Siri  43.0       40

In [15]:
d2.fillna(40)

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2      40  32.0  Chennai
3    Siri  43.0       40

**Method-2**

- we can fill the values w.r.t columns

In [17]:
d1['Age'].fillna(40)

#it will not updated because by default inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [18]:
d1

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [19]:
d1['Age'].fillna(40, inplace=True)
d1

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [21]:
d1['Names'].fillna('Uma', inplace=True)
d1

    Names   Age     City
0  Arvind  40.0      Hyd
1   Samar  21.0      Blr
2     Uma  32.0  Chennai
3    Siri  43.0      NaN

In [24]:
dict1={'Names':['Arvind','Samar',np.nan, 'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}

d1=pd.DataFrame(dict1)
d1

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

**Method-3**

- bfill
- ffill
- pad
- backfill

In [26]:
d1.fillna(method='bfill')
# bfill: uses next valid observation to fill gap.

#2	Siri	32.0	Chennai
#3	Siri	43.0	NaN

#Here in row 3 Names is filled with 'Siri' which is a valid value of the 4th row
#In 4th row, City value is 'Nan' because there is no next valid value , as it is a last row

C:\Users\User\AppData\Local\Temp\ipykernel_10028\3975924777.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

    Names   Age     City
0  Arvind  21.0      Hyd
1   Samar  21.0      Blr
2    Siri  32.0  Chennai
3    Siri  43.0      NaN

In [27]:
d1.fillna(method='ffill')

C:\Users\User\AppData\Local\Temp\ipykernel_10028\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2   Samar  32.0  Chennai
3    Siri  43.0  Chennai

In [28]:
d1.fillna(method='pad')

C:\Users\User\AppData\Local\Temp\ipykernel_10028\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2   Samar  32.0  Chennai
3    Siri  43.0  Chennai

In [31]:
d1.fillna(method='backfill',axis=1)
#if axis = 1 , means columns.
# that means Nan values will be filled next valid column values

C:\Users\User\AppData\Local\Temp\ipykernel_10028\1642743111.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill',axis=1)

    Names   Age     City
0  Arvind   Hyd      Hyd
1   Samar  21.0      Blr
2    32.0  32.0  Chennai
3    Siri  43.0      NaN

- bfill/backfill - they both fills the cells with next valid value
- ffill/pad-hey both fills the cells with previous valid value

- The value to be filled depends on the axis
      - If axis=1, the value filled will be column value
      - If axis=0(default value), the value filled will be row value

**Method -4**

- mean
    - Numerical value can be filled with mean value
    - but mean value are affected by outliers
    - if we dont have outliers it is the best one
- median
    - Numerical value can be filled with median value
    - Median value not affected by outliers
    - if outliers are there then go for median
- mode
    - Mode is useful for outliers

In [32]:
dict1={'Names':['Arvind','Samar',np.nan, 'Siri'],
      'Age':[np.nan,21,32,43],
      'City':['Hyd','Blr','Chennai',np.nan]}

d1=pd.DataFrame(dict1)
d1

    Names   Age     City
0  Arvind   NaN      Hyd
1   Samar  21.0      Blr
2     NaN  32.0  Chennai
3    Siri  43.0      NaN

In [33]:
#we already know that we can fill some values based on specific columns with fillna()
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [34]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [35]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    21.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

- Fill with random value
- Fill with random value on specific column
- Fill with methods
    - bfill,backfill,pad,ffill
- Fill with mean,median,mode

**Method -5**

**KNN imputer**

- KNN : K nearest neighbours
- K is a hyper parameter means user can choose
- It is a distance metric: **Euclidian distance**
- KNN imputer will take the mean of the neighbour values
- The neihbours value can be provided by using value=k
- It is under sklearn package
- Under sklearn we have Impurter method
- Under impurter method we have KnnImputer

In [36]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])